In [1]:
import pandas as pd

In [2]:
"hi"

'hi'

In [3]:
3+2

5

In [4]:
titanic = pd.read_csv('titanic.csv')

In [5]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [50]:
df = titanic.drop(['PassengerId','Ticket','Cabin'],axis=1)

In [7]:
result = titanic.axes

In [8]:
result

[RangeIndex(start=0, stop=891, step=1),
 Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
        'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
       dtype='object')]

In [9]:
df

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S
...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,13.0000,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,30.0000,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,23.4500,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,30.0000,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,7.7500,Q

In [10]:
#The “axes” is an attribute of the pandas DataFrame, this attribute is used to access the group of rows and columns labels of the given DataFrame

In [11]:
df['Age'].median()

np.float64(28.0)

In [12]:
df['Age'].fillna(df['Age'].median(), inplace=True)

C:\Users\Dhinesh\AppData\Local\Temp\ipykernel_14460\1933487976.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].median(), inplace=True)

In [13]:
df['Embarked'].mode()[0]

'S'

In [14]:
df['Embarked'].fillna(df['Embarked'].mode()[0], inplace=True)

C:\Users\Dhinesh\AppData\Local\Temp\ipykernel_14460\3744086084.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Embarked'].fillna(df['Embarked'].mode()[0], inplace=True)

In [15]:
df.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  891.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.361582    0.523008    0.381594   32.204208
std      0.486592    0.836071   13.019697    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   22.000000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   35.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [16]:
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S

In [17]:
tip = pd.read_csv('tips.csv')

In [18]:
tip

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [19]:
tip[['total_bill','smoker']]

     total_bill smoker
0         16.99     No
1         10.34     No
2         21.01     No
3         23.68     No
4         24.59     No
..          ...    ...
239       29.03     No
240       27.18    Yes
241       22.67    Yes
242       17.82     No
243       18.78     No

[244 rows x 2 columns]

In [20]:
tip['tip_percentage'] = round(tip['tip']/tip['total_bill']*100,2)

In [21]:
tip

     total_bill   tip     sex smoker   day    time  size  tip_percentage
0         16.99  1.01  Female     No   Sun  Dinner     2            5.94
1         10.34  1.66    Male     No   Sun  Dinner     3           16.05
2         21.01  3.50    Male     No   Sun  Dinner     3           16.66
3         23.68  3.31    Male     No   Sun  Dinner     2           13.98
4         24.59  3.61  Female     No   Sun  Dinner     4           14.68
..          ...   ...     ...    ...   ...     ...   ...             ...
239       29.03  5.92    Male     No   Sat  Dinner     3           20.39
240       27.18  2.00  Female    Yes   Sat  Dinner     2            7.36
241       22.67  2.00    Male    Yes   Sat  Dinner     2            8.82
242       17.82  1.75    Male     No   Sat  Dinner     2            9.82
243       18.78  3.00  Female     No  Thur  Dinner     2           15.97

[244 rows x 8 columns]

In [22]:
tip.drop('tip_percentage',axis=1,inplace=True)

In [23]:
tip

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [24]:
#to set index

In [25]:
#df=df.set_index("Payment ID")

In [26]:
tip.iloc[0]

total_bill     16.99
tip             1.01
sex           Female
smoker            No
day              Sun
time          Dinner
size               2
Name: 0, dtype: object

In [27]:
tip.iloc[0:5] #to take the sub section

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [28]:
tip.loc[1:1
    ]

   total_bill   tip   sex smoker  day    time  size
1       10.34  1.66  Male     No  Sun  Dinner     3

In [29]:
tip[tip["total_bill"]>40]

     total_bill    tip     sex smoker   day    time  size
59        48.27   6.73    Male     No   Sat  Dinner     4
95        40.17   4.73    Male    Yes   Fri  Dinner     4
102       44.30   2.50  Female    Yes   Sat  Dinner     3
142       41.19   5.00    Male     No  Thur   Lunch     5
156       48.17   5.00    Male     No   Sun  Dinner     6
170       50.81  10.00    Male    Yes   Sat  Dinner     3
182       45.35   3.50    Male    Yes   Sun  Dinner     3
184       40.55   3.00    Male    Yes   Sun  Dinner     2
197       43.11   5.00  Female    Yes  Thur   Lunch     4
212       48.33   9.00    Male     No   Sat  Dinner     4

In [30]:
tip["sex"]=="Male"

0      False
1       True
2       True
3       True
4      False
       ...
239     True
240    False
241     True
242     True
243    False
Name: sex, Length: 244, dtype: bool

In [31]:
tip[tip["sex"]=="Male"]

     total_bill   tip   sex smoker  day    time  size
1         10.34  1.66  Male     No  Sun  Dinner     3
2         21.01  3.50  Male     No  Sun  Dinner     3
3         23.68  3.31  Male     No  Sun  Dinner     2
5         25.29  4.71  Male     No  Sun  Dinner     4
6          8.77  2.00  Male     No  Sun  Dinner     2
..          ...   ...   ...    ...  ...     ...   ...
236       12.60  1.00  Male    Yes  Sat  Dinner     2
237       32.83  1.17  Male    Yes  Sat  Dinner     2
239       29.03  5.92  Male     No  Sat  Dinner     3
241       22.67  2.00  Male    Yes  Sat  Dinner     2
242       17.82  1.75  Male     No  Sat  Dinner     2

[157 rows x 7 columns]

In [32]:
tip[(tip["tip"]> 3) & (tip["sex"]=="Male")]

     total_bill   tip   sex smoker  day    time  size
2         21.01  3.50  Male     No  Sun  Dinner     3
3         23.68  3.31  Male     No  Sun  Dinner     2
5         25.29  4.71  Male     No  Sun  Dinner     4
7         26.88  3.12  Male     No  Sun  Dinner     4
9         14.78  3.23  Male     No  Sun  Dinner     2
..          ...   ...   ...    ...  ...     ...   ...
206       26.59  3.41  Male    Yes  Sat  Dinner     3
211       25.89  5.16  Male    Yes  Sat  Dinner     4
212       48.33  9.00  Male     No  Sat  Dinner     4
232       11.61  3.39  Male     No  Sat  Dinner     2
239       29.03  5.92  Male     No  Sat  Dinner     3

[66 rows x 7 columns]

In [33]:
cal = tip.loc[(tip["tip"] == 5.92) & (tip["sex"]=="Male"),'size'].item()

In [34]:
cal

3

In [35]:
tim = tip.loc[(tip["tip"] == 5.92) & (tip["sex"]=="Male"),'time'].item()

In [36]:
tim

'Dinner'

In [37]:
tip_male = tip[tip["sex"] == "Male"]

In [38]:
type(tip_male['total_bill'])

pandas.core.series.Series

In [39]:
list_male = tip_male['total_bill'].tolist()

In [40]:
list_male

[10.34,
 21.01,
 23.68,
 25.29,
 8.77,
 26.88,
 15.04,
 14.78,
 10.27,
 15.42,
 18.43,
 21.58,
 16.29,
 20.65,
 17.92,
 39.42,
 19.82,
 17.81,
 13.37,
 12.69,
 21.7,
 9.55,
 18.35,
 17.78,
 24.06,
 16.31,
 18.69,
 31.27,
 16.04,
 17.46,
 13.94,
 9.68,
 30.4,
 18.29,
 22.23,
 32.4,
 28.55,
 18.04,
 12.54,
 9.94,
 25.56,
 19.49,
 38.01,
 11.24,
 48.27,
 20.29,
 13.81,
 11.02,
 18.29,
 17.59,
 20.08,
 20.23,
 15.01,
 12.02,
 10.51,
 17.92,
 27.2,
 22.76,
 17.29,
 19.44,
 16.66,
 32.68,
 15.98,
 13.03,
 18.28,
 24.71,
 21.16,
 28.97,
 22.49,
 40.17,
 27.28,
 12.03,
 21.01,
 12.46,
 15.36,
 20.49,
 25.21,
 18.24,
 14.0,
 38.07,
 23.95,
 29.93,
 11.69,
 14.26,
 15.95,
 8.52,
 22.82,
 19.08,
 16.0,
 34.3,
 41.19,
 9.78,
 7.51,
 14.07,
 13.13,
 17.26,
 24.55,
 19.77,
 48.17,
 16.49,
 21.5,
 12.66,
 13.81,
 24.52,
 20.76,
 31.71,
 50.81,
 15.81,
 7.25,
 31.85,
 16.82,
 32.9,
 17.89,
 14.48,
 34.63,
 34.65,
 23.33,
 45.35,
 23.17,
 40.55,
 20.69,
 30.46,
 23.1,
 15.69,
 28.44,
 15.48,
 16.58,
 7.56,
 10.34,
 13.51,
 18.71,
 20.53,
 26.59,
 38.73,
 24.27,
 30.06,
 25.89,
 48.33,
 28.15,
 11.59,
 7.74,
 12.16,
 8.58,
 13.42,
 20.45,
 13.28,
 24.01,
 15.69,
 11.61,
 10.77,
 15.53,
 10.07,
 12.6,
 32.83,
 29.03,
 22.67,
 17.82]

In [41]:
data = pd.DataFrame([
        {"Asset": "Stock", "Name": "TCS.NS", "Qty": 5, "Avg Price": 3200},
        {"Asset": "Stock", "Name": "ITC.NS", "Qty": 5, "Avg Price": 3200},
        {"Asset": "Stock", "Name": "INFY.NS", "Qty": 5, "Avg Price": 3200},
        {"Asset": "MF", "Name": "NIFTY50", "Qty": 5, "Avg Price": 3200},
        {"Asset": "Gold", "Name": "Gold ETF", "Qty": 10, "Avg Price": None}
    ])

In [42]:
data

   Asset      Name  Qty  Avg Price
0  Stock    TCS.NS    5     3200.0
1  Stock    ITC.NS    5     3200.0
2  Stock   INFY.NS    5     3200.0
3     MF   NIFTY50    5     3200.0
4   Gold  Gold ETF   10        NaN

In [43]:
qty = data.loc[(data["Asset"] == "Stock") & (data["Name"] == "ITC.NS"), "Qty"].item()

In [44]:
avg_price = data.loc[(data["Asset"] == "Stock") & (data["Name"] == "ITC.NS"), "Avg Price"].item()

In [45]:
avg_price

3200.0

In [46]:
data[(data["Asset"] == "Stock") & ((data["Name"]))]

   Asset     Name  Qty  Avg Price
0  Stock   TCS.NS    5     3200.0
1  Stock   ITC.NS    5     3200.0
2  Stock  INFY.NS    5     3200.0

In [47]:
stock_list = data.loc[(data["Asset"] == "Stock") , "Name"].tolist()

In [48]:
stock_list

['TCS.NS', 'ITC.NS', 'INFY.NS']

In [49]:
data["Name"].split(".")

AttributeError: 'Series' object has no attribute 'split'

In [ ]:
stock = pd.read_csv('C://VS_Code//Python_Works//fetquest-Stocklytics//nse_equity.csv')

In [ ]:
stock

,SYMBOL,NAME OF COMPANY,SERIES,DATE OF LISTING,PAID UP VALUE,MARKET LOT,ISIN NUMBER,FACE VALUE
0,20MICRONS,20 Microns Limited,EQ,06-OCT-2008,5,1,INE144J01027,5
1,21STCENMGM,21st Century Management Services Limited,EQ,03-MAY-1995,10,1,INE253B01015,10
2,360ONE,360 ONE WAM LIMITED,EQ,19-SEP-2019,1,1,INE466L01038,1
3,3IINFOLTD,3i Infotech Limited,EQ,22-OCT-2021,10,1,INE748C01038,10
4,3MINDIA,3M India Limited,EQ,13-AUG-2004,10,1,INE470A01017,10
...,...,...,...,...,...,...,...,...
2165,ZOTA,Zota Health Care LImited,EQ,19-AUG-2019,10,1,INE358U01012,10
2166,ZUARI,Zuari Agro Chemicals Limited,EQ,27-NOV-2012,10,1,INE840M01016,10
2167,ZUARIIND,ZUARI INDUSTRIES LIMITED,EQ,12-APR-1995,10,1,INE217A01012,10
2168,ZYDUSLIFE,Zydus Lifesciences Limited,EQ,18-APR-2000,1,1,INE010B01027,1
2169,ZYDUSWELL,Zydus Wellness Limited,EQ,13-NOV-2009,10,1,INE768C01010,10

In [ ]:
cos = stock['NAME OF COMPANY'].tolist()

In [ ]:
cos

['20 Microns Limited',
 '21st Century Management Services Limited',
 '360 ONE WAM LIMITED',
 '3i Infotech Limited',
 '3M India Limited',
 '3P Land Holdings Limited',
 '5Paisa Capital Limited',
 '63 moons technologies limited',
 'A2Z Infra Engineering Limited',
 'AAA Technologies Limited',
 'Aadhar Housing Finance Limited',
 'Aakash Exploration Services Limited',
 'Aarey Drugs & Pharmaceuticals Limited',
 'Aaron Industries Limited',
 'Aartech Solonics Limited',
 'Aarti Drugs Limited',
 'Aarti Industries Limited',
 'Aarti Pharmalabs Limited',
 'Aarti Surfactants Limited',
 'Aarvee Denims & Exports Limited',
 'Aarvi Encon Limited',
 'Aavas Financiers Limited',
 'Aban Offshore Limited',
 'ABB India Limited',
 'Abbott India Limited',
 'Aditya Birla Capital Limited',
 'Allied Blenders and Distillers Limited',
 'Aditya Birla Fashion and Retail Limited',
 'A B Infrabuild Limited',
 'Aditya Birla Lifestyle Brands Limited',
 'ABM International Limited',
 'Aditya Birla Real Estate Limited',
 'Aditya Birla Sun Life AMC Limited',
 'ACC Limited',
 'Accelya Solutions India Limited',
 'Accuracy Shipping Limited',
 'Action Construction Equipment Limited',
 'Ace Integrated Solutions Limited',
 'Archean Chemical Industries Limited',
 'Andhra Cements Limited',
 'Allcargo Gati Limited',
 'Acme Solar Holdings Limited',
 'Acutaas Chemicals Limited',
 'Adani Energy Solutions Limited',
 'Adani Enterprises Limited',
 'Adani Green Energy Limited',
 'Adani Ports and Special Economic Zone Limited',
 'Adani Power Limited',
 'ADF Foods Limited',
 'Archidply Decor Limited',
 'Ador Welding Limited',
 'Adroit Infotech Limited',
 'Allied Digital Services Limited',
 'Advani Hotels & Resorts (India) Limited',
 'Advanced Enzyme Technologies Limited',
 'Aegis Logistics Limited',
 'Aegis Vopak Terminals Limited',
 'Aeroflex Enterprises Limited',
 'Aeroflex Industries Limited',
 'Aeroflex Neu Limited',
 'Aether Industries Limited',
 'Afcons Infrastructure Limited',
 'Affle 3i Limited',
 'Affordable Robotic & Automation Limited',
 'Akme Fintrade (India) Limited',
 'Abans Financial Services Limited',
 'Agarwal Industrial Corporation Limited',
 "Dr. Agarwal's Health Care Limited",
 'AGI Greenpac Limited',
 'Agi Infra Limited',
 'Agri-Tech (India) Limited',
 'Agro Phos India Limited',
 'AGS Transact Technologies Limited',
 'Ahlada Engineers Limited',
 'Asian Hotels (East) Limited',
 'Ahluwalia Contracts (India) Limited',
 'AIA Engineering Limited',
 'Authum Investment & Infrastructure Limited',
 'Airan Limited',
 'Airo Lam limited',
 'Ajanta Pharma Limited',
 'Ajax Engineering Limited',
 'Ajmera Realty & Infra India Limited',
 'Ajooni Biotech Limited',
 'Akash Infra-Projects Limited',
 'Akg Exim Limited',
 'AKI India Limited',
 'Akshar Spintex Limited',
 'AksharChem India Limited',
 'Aksh Optifibre Limited',
 'Akums Drugs and Pharmaceuticals Limited',
 'Akzo Nobel India Limited',
 'Alankit Limited',
 'Albert David Limited',
 'Alembic Limited',
 'Alicon Castalloy Limited',
 'Alivus Life Sciences Limited',
 'Alkali Metals Limited',
 'Alkem Laboratories Limited',
 'Alkyl Amines Chemicals Limited',
 'Allcargo Logistics Limited',
 'Alldigi Tech Limited',
 'All Time Plastics Limited',
 'Almondz Global Securities Limited',
 'Alok Industries Limited',
 'Alpa Laboratories Limited',
 'Alphageo (India) Limited',
 'Alps Industries Limited',
 'Amber Enterprises India Limited',
 'Ambica Agarbathies & Aroma industries Limited',
 'Ambika Cotton Mills Limited',
 'Ambuja Cements Limited',
 'AMD Industries Limited',
 'Amj Land Holdings Limited',
 'Amines & Plasticizers Limited',
 'Amrutanjan Health Care Limited',
 'Anand Rathi Wealth Limited',
 'Anant Raj Limited',
 'ANDHRA PAPER LIMITED',
 'The Andhra Sugars Limited',
 'Angel One Limited',
 'Anik Industries Limited',
 'Ankit Metal & Power Limited',
 'Anmol India Limited',
 'Ansal Properties & Infrastructure Limited',
 'Antarctica Limited',
 'Anthem Biosciences Limited',
 'Anuh Pharma Limited',
 'The Anup Engineering Limited',
 'Anupam Rasayan India Limited',
 'Apar Industries Limited',
 'Anjani Portland Cement Limited',
 'Apcotex Industries Limited',
 'Apex Frozen Foods Limited',
 'APL Apollo Tubes Limited',
 'Alembic Pharmaceuticals Limited',
 'Apollo Micro Systems Limited',
 'Apollo Hospitals Enterprise Limited',
 'Apollo Pipes Limited',
 'Apollo Tyres Limited',
 'Apollo Sindoori Hotels Limited',
 'Aptech Limited',
 'Aptus Value Housing Finance India Limited',
 'Archidply Industries Limited',
 'Archies Limited',
 'Amara Raja Energy & Mobility Limited',
 'Rajdarshan Industries Limited',
 'Arfin India Limited',
 'Aries Agro Limited',
 'Arihant Capital Markets Limited',
 'Arihant Superstructures Limited',
 'Arisinfra Solutions Limited',
 'Arkade Developers Limited',
 'Arman Financial Services Limited',
 'Aro Granite Industries Limited',
 'Arrow Greentech Limited',
 'Arshiya Limited',
 'ARSS Infrastructure Projects Limited',
 'Artemis Medicare Services Limited',
 'Art Nirman Limited',
 'Arvee Laboratories (India) Limited',
 'Arvind Limited',
 'Arvind Fashions Limited',
 'Arvind SmartSpaces Limited',
 'Asahi India Glass Limited',
 'Asahi Songwon Colors Limited',
 'Automotive Stampings and Assemblies Limited',
 'Associated Alcohols & Breweries Ltd.',
 'Ashapura Minechem Limited',
 'Ashiana Housing Limited',
 'Ashima Limited',
 'Ashoka Buildcon Limited',
 'Ashoka Metcast Limited',
 'Ashok Leyland Limited',
 'Asian Energy Services Limited',
 'Asian Hotels (North) Limited',
 'Asian Paints Limited',
 'Asian Granito India Limited',
 'ASK Automotive Limited',
 'Bartronics India Limited',
 'Aspinwall and Company Limited',
 'Astec LifeSciences Limited',
 'Aster DM Healthcare Limited',
 'Astral Limited',
 'Astra Microwave Products Limited',
 'AstraZeneca Pharma India Limited',
 'Astron Paper & Board Mill Limited',
 'Atal Realtech Limited',
 'Atam Valves Limited',
 'Adani Total Gas Limited',
 'Ather Energy Limited',
 'Allcargo Terminals Limited',
 'ATLANTAA LIMITED',
 'Atlas Cycles (Haryana) Limited',
 'Atul Limited',
 'Atul Auto Limited',
 'AU Small Finance Bank Limited',
 'Aurionpro Solutions Limited',
 'Aurobindo Pharma Limited',
 'Aurum PropTech Limited',
 'Ausom Enterprise Limited',
 'Automotive Axles Limited',
 'Autoline Industries Limited',
 'Avadh Sugar & Energy Limited',
 'Avalon Technologies Limited',
 'Avantel Limited',
 'Avanti Feeds Limited',
 'AVG Logistics Limited',
 'Aditya Vision Limited',
 'Avonmore Capital & Management Services Limited',
 'AVRO INDIA LIMITED',
 'AVT Natural Products Limited',
 'Awfis Space Solutions Limited',
 'Antony Waste Handling Cell Limited',
 'AWL Agri Business Limited',
 'Axis Bank Limited',
 'AXISCADES Technologies Limited',
 'Axita Cotton Limited',
 'AYM Syntex Limited',
 'Azad Engineering Limited',
 'Bafna Pharmaceuticals Limited',
 'B.A.G Films and Media Limited',
 'Baid Finserv Limited',
 'Bajaj Auto Limited',
 'Bajaj Consumer Care Limited',
 'Bajaj Electricals Limited',
 'Bajaj Finserv Limited',
 'Bajaj Healthcare Limited',
 'Bajaj Housing Finance Limited',
 'Bajaj Hindusthan Sugar Limited',
 'Bajaj Holdings & Investment Limited',
 'Indef Manufacturing Limited',
 'Bajel Projects Limited',
 'Bajaj Finance Limited',
 'Shree Tirupati Balajee Agro Trading Company Limited',
 'Balaji Telefilms Limited',
 'Balaji Amines Limited',
 'BALAXI PHARMACEUTICALS LIMITED',
 'Balkrishna Paper Mills Limited',
 'Balkrishna Industries Limited',
 'Balmer Lawrie & Company Limited',
 'Bal Pharma Limited',
 'Balrampur Chini Mills Limited',
 'Balu Forge Industries Limited',
 'Banaras Beads Limited',
 'Bannari Amman Sugars Limited',
 'Banco Products (I) Limited',
 'Bandhan Bank Limited',
 'Bang Overseas Limited',
 'Banka BioLoo Limited',
 'Bank of Baroda',
 'Bank of India',
 'Bansal Wire Industries Limited',
 'Banswara Syntex Limited',
 'Barbeque Nation Hospitality Limited',
 'BASF India Limited',
 'Bannari Amman Spinning Mills Limited',
 'Bata India Limited',
 'Bayer Cropscience Limited',
 'Bharat Bijlee Limited',
 'Black Box Limited',
 'Bombay Burmah Trading Corporation Limited',
 'B&B Triplewall Containers Limited',
 'Brightcom Group Limited',
 'Bcl Industries Limited',
 'Brand Concepts Limited',
 'Bharat Dynamics Limited',
 'Beardsell Limited',
 'Mrs. Bectors Food Specialities Limited',
 'Bedmutha Industries Limited',
 'Bharat Electronics Limited',
 'Bella Casa Fashion & Retail Limited',
 'Belrise Industries Limited',
 'BEML Limited',
 'Bhansali Engineering Polymers Limited',
 'Berger Paints (I) Limited',
 'Best Agrolife Limited',
 'BF Investment Limited',
 'BF Utilities Limited',
 'Bharatiya Global Infomedia Limited',
 'BGR Energy Systems Limited',
 'Bhagiradha Chemicals & Industries Limited',
 'Bhageria Industries Limited',
 'Bhagyanagar India Limited',
 'Bhandari Hosiery Exports Limited',
 'Bharat Forge Limited',
 'Bharat Gears Limited',
 'Bharat Rasayan Limited',
 'Bharat Seats Limited',
 'Bharat Wire Ropes Limited',
 'Bharti Airtel Limited',
 'Bharti Hexacom Limited',
 'Bharat Heavy Electricals Limited',
 'Bigbloc Construction Limited',
 'Bikaji Foods International Limited',
 'Bhartiya International Limited',
 'BIL VYAPAR LIMITED',
 'Biocon Limited',
 'Biofil Chemicals & Pharmaceuticals Limited',
 'Birla Cable Limited',
 'Birla Corporation Limited',
 'Aditya Birla Money Limited',
 'BirlaNu Limited',
 'Zinka Logistics Solutions Limited',
 'BEML Land Assets Limited',
 'BLB Limited',
 'Bliss GVS Pharma Limited',
 'B. L. Kashyap and Sons Limited',
 'BLS International Services Limited',
 'BLS E-Services Limited',
 'Blue Chip India Limited',
 'Blue Coast Hotels Limited',
 'Blue Dart Express Limited',
 'Blue Jet Healthcare Limited',
 'Blue Star Limited',
 'BlueStone Jewellery and Lifestyle Limited',
 'Bluspring Enterprises Limited',
 'Bodal Chemicals Limited',
 'Bohra Industries Limited',
 'Bombay Dyeing & Mfg Company Limited',
 'Borana Weaves Limited',
 'Borosil Limited',
 'BOROSIL RENEWABLES LIMITED',
 'Borosil Scientific Limited',
 'Bosch Limited',
 'Bharat Petroleum Corporation Limited',
 'BPL Limited',
 'Brigade Enterprises Limited',
 'Brigade Hotel Ventures Limited',
 'Britannia Industries Limited',
 'Bharat Road Network Limited',
 'Brooks Laboratories Limited',
 'BSE Limited',
 'Bombay Super Hybrid Seeds Limited',
 'BSL Limited',
 'BIRLASOFT LIMITED',
 'Bodhi Tree Multimedia Limited',
 'Butterfly Gandhimathi Appliances Limited',
 'Barak Valley Cements Limited',
 'The Byke Hospitality Ltd',
 'California Software Company Limited',
 'Camlin Fine Sciences Limited',
 'Campus Activewear Limited',
 'Computer Age Management Services Limited',
 'Canara Bank',
 'Can Fin Homes Limited',
 'Cantabil Retail India Limited',
 "Capacit'e Infraprojects Limited",
 'Capital Small Finance Bank Limited',
 'Caplin Point Laboratories Limited',
 'Capital Trust Limited',
 'Carborundum Universal Limited',
 'CARE Ratings Limited',
 'Carraro India Limited',
 'Cartrade Tech Limited',
 'CARYSIL LIMITED',
 'Castrol India Limited',
 'Consolidated Construction Consortium Limited',
 'Country Club Hospitality & Holidays Limited',
 'CCL Products (India) Limited',
 'Central Depository Services (India) Limited',
 'CEAT Limited',
 'Ceigall India Limited',
 'Celebrity Fashions Limited',
 'Cello World Limited',
 'Century Enka Limited',
 'Century Extrusions Limited',
 'Central Bank of India',
 'Centrum Capital Limited',
 'Centum Electronics Limited',
 'Century Plyboards (India) Limited',
 'Cera Sanitaryware Limited',
 'Cerebra Integrated Technologies Limited',
 'CESC Limited',
 'Concord Enviro Systems Limited',
 'Capri Global Capital Limited',
 'CG Power and Industrial Solutions Limited',
 'Chalet Hotels Limited',
 'Chambal Fertilizers & Chemicals Limited',
 'Chembond Material Technologies Limited',
 'Chembond Chemicals Limited',
 'Chemcon Speciality Chemicals Limited',
 'Chemfab Alkalis Limited',
 'Chemplast Sanmar Limited',
 'Chennai Petroleum Corporation Limited',
 'Cheviot Company Limited',
 'Choice International Limited',
 'Cholamandalam Investment and Finance Company Limited',
 'Cholamandalam Financial Holdings Limited',
 'CIE Automotive India Limited',
 'Capital India Finance Limited',
 'Cigniti Technologies Limited',
 'Cineline India Limited',
 'Cinevista Limited',
 'Cipla Limited',
 'Clean Science and Technology Limited',
 'CL Educate Limited',
 'Chaman Lal Setia Exports Limited',
 'CMI Limited',
 'CMS Info Systems Limited',
 'Coal India Limited',
 'Coastal Corporation Limited',
 'Cochin Shipyard Limited',
 'Coffee Day Enterprises Limited',
 'Coforge Limited',
 'Cohance Lifesciences Limited',
 'Colgate Palmolive (India) Limited',
 'Compuage Infocom Limited',
 'Compucom Software Limited',
 'Commercial Syn Bags Limited',
 'Container Corporation of India Limited',
 'Concord Biotech Limited',
 'Confidence Petroleum India Limited',
 'Consolidated Finvest & Holdings Limited',
 'Control Print Limited',
 'Coral India Finance & Housing Limited',
 'Cords Cable Industries Limited',
 'Coromandel International Limited',
 'COSMO FIRST LIMITED',
 "Country Condo's Limited",
 'CP Capital Limited',
 'Aditya Infotech Limited',
 'Craftsman Automation Limited',
 'Creative Newtech Limited',
 'Creative Eye Limited',
 'CREDITACCESS GRAMEEN LIMITED',
 'Crest Ventures Limited',
 'CRISIL Limited',
 'Crizac Limited',
 'Crompton Greaves Consumer Electricals Limited',
 'Crown Lifters Limited',
 'CSB Bank Limited',
 'CSL Finance Limited',
 'Cambridge Technology Enterprises Limited',
 'City Union Bank Limited',
 'Cubex Tubings Limited',
 'Cummins India Limited',
 'Cupid Limited',
 'Cura Technologies Limited',
 'Cyber Media (India) Limited',
 'Cybertech Systems And Software Limited',
 'Cyient Limited',
 'Cyient DLM Limited',
 'Dabur India Limited',
 'Dalmia Bharat Limited',
 'Dalmia Bharat Sugar and Industries Limited',
 'Dam Capital Advisors Limited',
 'Damodar Industries Limited',
 'Dangee Dums Limited',
 'Datamatics Global Services Limited',
 'Data Patterns (India) Limited',
 'Davangere Sugar Company Limited',
 'D.B.Corp Limited',
 'Deepak Builders & Engineers India Limited',
 'Dilip Buildcon Limited',
 'Dhampur Bio Organics Limited',
 'Valor Estate Limited',
 'DB (International) Stock Brokers Limited',
 'Dishman Carbogen Amcis Limited',
 'DCB Bank Limited',
 'Dc Infotech And Communication Limited',
 'DCM  Limited',
 'DCM Financial Services Limited',
 'DCM Nouvelle Limited',
 'DCM Shriram Limited',
 'DCM Shriram Industries Limited',
 'DCW Limited',
 'DCX Systems Limited',
 'Ddev Plastiks Industries Limited',
 'Deccan Cements Limited',
 'DEE Development Engineers Limited',
 'Deepak Fertilizers and Petrochemicals Corporation Limited',
 'Deepak Nitrite Limited',
 'Deep Industries Limited',
 'Delhivery Limited',
 'DELPHI WORLD MONEY LIMITED',
 'Delta Corp Limited',
 'Delta Manufacturing Limited',
 'Den Networks Limited',
 'De Nora India Limited',
 'Denta Water and Infra Solutions Limited',
 'Dev Information Technology Limited',
 'Devyani International Limited',
 'Digicontent Limited',
 'Dhampur Sugar Mills Limited',
 'Dhanlaxmi Bank Limited',
 'Dhani Services Limited',
 'Dhanuka Agritech Limited',
 'DHARAN INFRA-EPC LIMITED',
 'Dharmaj Crop Guard Limited',
 'Dhruv Consultancy Services Limited',
 'Dhunseri Investments Limited',
 'Diamond Power Infrastructure Limited',
 'Diamines & Chemicals Limited',
 'Prataap Snacks Limited',
 'DIC India Limited',
 'Diffusion Engineers Limited',
 'Digidrive Distributors Limited',
 'DiGiSPICE Technologies Limited',
 'Digitide Solutions Limited',
 'Digjam Limited',
 'Debock Industries Limited',
 'Dish TV India Limited',
 'Divgi Torqtransfer Systems Limited',
 "Divi's Laboratories Limited",
 'Dixon Technologies (India) Limited',
 'DJ Mediaprint & Logistics Limited',
 'DLF Limited',
 'D-Link (India) Limited',
 'Avenue Supermarts Limited',
 'DMCC SPECIALITY CHEMICALS LIMITED',
 'Diligent Media Corporation Limited',
 'Dodla Dairy Limited',
 'Dolat Algotech Limited',
 'Dollar Industries Limited',
 'Dolphin Offshore Enterprises (India) Limited',
 'DOMS Industries Limited',
 'Donear Industries Limited',
 'D. P. Abhushan Limited',
 'DPSC Limited',
 'D P Wires Limited',
 'DRC Systems India Limited',
 'Dreamfolks Services Limited',
 'Dredging Corporation of India Limited',
 "Dr. Reddy's Laboratories Limited",
 'Dynacons Systems & Solutions Limited',
 'Dhunseri Tea & Industries Limited',
 'Ducon Infratechnologies Limited',
 'Dhunseri Ventures Limited',
 'Dwarikesh Sugar Industries Limited',
 'Dynamic Cables Limited',
 'Dynamatic Technologies Limited',
 'Dynemic Products Limited',
 'E2E Networks Limited',
 'Easy Trip Planners Limited',
 'Eastern Silk Industries Limited',
 'GNG Electronics Limited',
 'eClerx Services Limited',
 'Ecos (India) Mobility & Hospitality Limited',
 'Edelweiss Financial Services Limited',
 'Educomp Solutions Limited',
 'EFC (I) Limited',
 'Eicher Motors Limited',
 'EID Parry India Limited',
 'Enviro Infra Engineers Limited',
 'Euro India Fresh Foods Limited',
 'EIH Associated Hotels Limited',
 'EIH Limited',
 'Eimco Elecon (India) Limited',
 'Everest Kanto Cylinder Limited',
 'Eldeco Housing And Industries Limited',
 'Elecon Engineering Company Limited',
 'Electrosteel Castings Limited',
 'Electrotherm (India) Limited',
 'Elgi Equipments Limited',
 'Elgi Rubber Company Limited',
 'Elin Electronics Limited',
 'Ellenbarrie Industrial Gases Limited',
 'Emami Limited',
 'Emami Paper Mills Limited',
 'Emami Realty Limited',
 'Embassy Developments Limited',
 'Emcure Pharmaceuticals Limited',
 'Electronics Mart India Limited',
 'Emkay Global Financial Services Limited',
 'Emmbi Industries Limited',
 'EMS Limited',
 'eMudhra Limited',
 'Endurance Technologies Limited',
 'Energy Development Company Limited',
 'Engineers India Limited',
 'Entertainment Network (India) Limited',
 'Siemens Energy India Limited',
 'Entero Healthcare Solutions Limited',
 'EPACK Durable Limited',
 'Epigral Limited',
 'EPL Limited',
 'Equippp Social Impact Technologies Limited',
 'Equitas Small Finance Bank Limited',
 'Eris Lifesciences Limited',
 'Esab India Limited',
 'ESAF Small Finance Bank Limited',
 'Escorts Kubota Limited',
 'Essar Shipping Limited',
 'Integra Essentia Limited',
 'Ester Industries Limited',
 'ETERNAL LIMITED',
 'Ethos Limited',
 'Eureka Forbes Limited',
 'Euro Panel Products Limited',
 'Eurotex Industries and Exports Limited',
 'Eveready Industries India Limited',
 'Everest Industries Limited',
 'Excel Realty N Infra Limited',
 'Excel Industries Limited',
 'Exicom Tele-Systems Limited',
 'Exide Industries Limited',
 'Expleo Solutions Limited',
 'Exxaro Tiles Limited',
 'Fertilizers and Chemicals Travancore Limited',
 'Fairchem Organics Limited',
 'Faze Three Limited',
 'Fineotex Chemical Limited',
 'Future Consumer Limited',
 'FCS Software Solutions Limited',
 'FDC Limited',
 'The Federal Bank  Limited',
 'Fedbank Financial Services Limited',
 'Future Enterprises Limited',
 'Future Enterprises Limited',
 'Fiberweb (India) Limited',
 'Fiem Industries Limited',
 'Filatex India Limited',
 'Filatex Fashions Limited',
 'Finolex Cables Limited',
 'Fine Organic Industries Limited',
 'Fino Payments Bank Limited',
 'Finolex Industries Limited',
 'Brainbees Solutions Limited',
 'Fischer Medical Ventures Limited',
 'Five-Star Business Finance Limited',
 'Flair Writing Industries Limited',
 'Flexituff Ventures International Limited',
 'Future Lifestyle Fashions Limited',
 'Gujarat Fluorochemicals Limited',
 'Federal-Mogul Goetze (India) Limited.',
 'Future Market Networks Limited',
 'Focus Lighting and Fixtures Limited',
 'Foods & Inns Limited',
 'FORCE MOTORS LTD',
 'Fortis Healthcare Limited',
 'Foseco India Limited',
 'Future Supply Chain Solutions Limited',
 'Firstsource Solutions Limited',
 'Fusion Finance Limited',
 'Gabriel India Limited',
 'Gujarat Ambuja Exports Limited',
 'GAIL (India) Limited',
 'Gala Precision Engineering Limited',
 'Galaxy Surfactants Limited',
 'Gallantt Ispat Limited',
 'Gandhar Oil Refinery (India) Limited',
 'Gandhi Special Tubes Limited',
 'Ganesha Ecosphere Limited',
 'Ganesh Benzoplast Limited',

In [ ]:
stock_symbol = stock.loc[stock["NAME OF COMPANY"] == "3M India Limited","SYMBOL"].item()

'3MINDIA'

In [ ]:
stock["NAME OF COMPANY"] = stock["NAME OF COMPANY"].str.lower()

In [ ]:
stock

,SYMBOL,NAME OF COMPANY,SERIES,DATE OF LISTING,PAID UP VALUE,MARKET LOT,ISIN NUMBER,FACE VALUE
0,20MICRONS,20 microns limited,EQ,06-OCT-2008,5,1,INE144J01027,5
1,21STCENMGM,21st century management services limited,EQ,03-MAY-1995,10,1,INE253B01015,10
2,360ONE,360 one wam limited,EQ,19-SEP-2019,1,1,INE466L01038,1
3,3IINFOLTD,3i infotech limited,EQ,22-OCT-2021,10,1,INE748C01038,10
4,3MINDIA,3m india limited,EQ,13-AUG-2004,10,1,INE470A01017,10
...,...,...,...,...,...,...,...,...
2165,ZOTA,zota health care limited,EQ,19-AUG-2019,10,1,INE358U01012,10
2166,ZUARI,zuari agro chemicals limited,EQ,27-NOV-2012,10,1,INE840M01016,10
2167,ZUARIIND,zuari industries limited,EQ,12-APR-1995,10,1,INE217A01012,10
2168,ZYDUSLIFE,zydus lifesciences limited,EQ,18-APR-2000,1,1,INE010B01027,1
2169,ZYDUSWELL,zydus wellness limited,EQ,13-NOV-2009,10,1,INE768C01010,10

In [ ]:
stock_symbol = stock.loc[stock["NAME OF COMPANY"] == "zuari agro chemicals limited","SYMBOL"].item()

In [ ]:
stock_symbol

'ZUARI'

In [ ]:
mf = pd.read_csv('C://VS_Code//Python_Works//fetquest-Stocklytics//amfi_mutual_fund_list.csv')

In [ ]:
mf

,Scheme Code,Scheme Name,ISIN Div Payout/ ISIN Growth,ISIN Div Reinvestment,Net Asset Value,Date
0,119551,Aditya Birla Sun Life Banking & PSU Debt Fund ...,INF209KA12Z1,INF209KA13Z9,108.0297,29-Aug-2025
1,119552,Aditya Birla Sun Life Banking & PSU Debt Fund ...,INF209K01YM2,-,117.5059,29-Aug-2025
2,119553,Aditya Birla Sun Life Banking & PSU Debt Fund ...,INF209K01YO8,-,105.1883,29-Aug-2025
3,108272,Aditya Birla Sun Life Banking & PSU Debt Fund ...,INF209K01LX6,INF209KA11Z3,151.6667,29-Aug-2025
4,110282,Aditya Birla Sun Life Banking & PSU Debt Fund ...,INF209K01LU2,-,113.2433,29-Aug-2025
...,...,...,...,...,...,...
13997,109618,UTI Quarterly Interval Fund - II - Regular Pla...,INF789F01GU3,INF789F01GV1,10.9879,25-Mar-2025
13998,121722,UTI Quarterly Interval Fund - III -Direct Plan...,INF789F01WU0,-,31.2226,25-Mar-2025
13999,121721,UTI Quarterly Interval Fund - III -Direct Plan...,INF789F01WS4,INF789F01WT2,11.1322,25-Mar-2025
14000,110024,UTI Quarterly Interval Fund - III -Regular Pla...,INF789F01HC9,-,30.4741,25-Mar-2025
14001,110021,UTI Quarterly Interval Fund - III -Regular Pla...,INF789F01HA3,INF789F01HB1,11.0613,25-Mar-2025

In [ ]:
fund_name = "Aditya Birla Sun Life Banking & PSU Debt Fund  - DIRECT - MONTHLY IDCW"

In [ ]:
match = mf.loc[mf["Scheme Name"] == fund_name,"ISIN Div Payout/ ISIN Growth"]

In [ ]:
match

1    INF209K01YM2
Name: ISIN Div Payout/ ISIN Growth, dtype: object

In [ ]:
match = mf.loc[mf["Scheme Name"] == fund_name,"ISIN Div Payout/ ISIN Growth"]

In [ ]:
match

1    INF209K01YM2
Name: ISIN Div Payout/ ISIN Growth, dtype: object

In [ ]:
s = {'message': 'duplicate key value violates unique constraint "fet_portfolio_holdings_pkey"', 'code': '23505', 'hint': None, 'details': 'Key (asset)=(itc limited) already exists.'}

In [ ]:
k = str(s)

In [ ]:
k.split(",")[3].split("=")[1].split("(")[1].split(")")[0]

'itc limited'

In [ ]:
k.split(",")[3]

" 'details': 'Key (asset)=(itc limited) already exists.'}"

In [1]:
import yfinance as yf

In [2]:
reliance = yf.Ticker("RELIANCE.NS")
reliance.info.get("currentPrice")
reliance.info.get("industry", "N/A")
reliance.info.get("sectorKey", "N/A")
reliance.info.get("bookValue")
reliance.info.get("priceToBook")
reliance.info.get("marketCap")

18688344326144

In [ ]:
reliance.analyst_price_targets

{'current': 1359.3,
 'high': 1850.0,
 'low': 1300.0,
 'mean': 1640.4572,
 'median': 1660.0}

In [ ]:
reliance.recommendations

  period  strongBuy  buy  hold  sell  strongSell
0     0m         11   21     1     1           1
1    -1m         12   20     1     1           1
2    -2m         12   19     1     1           1
3    -3m         12   20     1     1           1

In [ ]:
reliance.eps_trend

         current  7daysAgo  30daysAgo  60daysAgo  90daysAgo
period
0q      14.50028    14.645   13.79667     14.295     14.295
+1q     15.17033    15.650   14.61667     15.560     15.560
0y      26.40000    26.400   27.90000     37.050     37.050
+1y     25.90000    25.900   29.25000     39.250     39.250

In [ ]:
reliance.recommendations['strongBuy'].iloc[0]

np.int64(11)

In [ ]:
reliance.recommendations['strongBuy']

0    11
1    12
2    12
3    12
Name: strongBuy, dtype: int64

In [ ]:
df = yf.download("RELIANCE.NS", period="1mo")
max_high = df['High'].max().iloc[0]
min_low = df ['Low'].min().iloc[0]

C:\Users\Dhinesh\AppData\Local\Temp\ipykernel_18848\1708903062.py:1: FutureWarning: YF.download() has changed argument auto_adjust default to True
  df = yf.download("RELIANCE.NS", period="1mo")
[*********************100%***********************]  1 of 1 completed

In [ ]:
max_high

np.float64(1431.9000244140625)

In [ ]:
min_low

np.float64(1340.5999755859375)

In [ ]:
df

Price             Close         High          Low         Open      Volume
Ticker      RELIANCE.NS  RELIANCE.NS  RELIANCE.NS  RELIANCE.NS RELIANCE.NS
Date
2025-08-04  1405.885010  1410.466687  1386.163726  1389.550225     6312820
2025-08-05  1386.163696  1405.386969  1382.578042  1405.386969     9315972
2025-08-06  1387.259521  1390.347165  1377.797312  1386.363077     5834312
2025-08-07  1383.872925  1388.155746  1360.565987  1382.179615     9976705
2025-08-08  1362.358887  1391.641835  1359.569977  1379.490416     8793606
2025-08-11  1380.685669  1382.478557  1355.785119  1364.550161     9997486
2025-08-12  1374.908813  1396.323287  1369.729426  1376.402846    12244664
2025-08-13  1377.099976  1386.263451  1372.020288  1382.478519     7457021
2025-08-14  1373.800049  1380.699951  1370.099976  1377.300049     7126128
2025-08-18  1381.699951  1394.900024  1377.000000  1390.000000    11785109
2025-08-19  1420.099976  1421.000000  1389.099976  1390.000000    14384719
2025-08-20  1413.000000  1424.900024  1410.000000  1413.000000     8725641
2025-08-21  1424.800049  1431.900024  1420.300049  1425.000000    11021323
2025-08-22  1409.199951  1423.400024  1407.900024  1420.000000     5818868
2025-08-25  1412.599976  1419.500000  1405.699951  1414.699951     5979407
2025-08-26  1384.900024  1410.000000  1381.599976  1408.000000    12145259
2025-08-27  1384.900024  1384.900024  1384.900024  1384.900024           0
2025-08-28  1385.900024  1392.199951  1366.500000  1389.900024    13161813
2025-08-29  1357.199951  1403.500000  1350.000000  1381.099976    18758842
2025-09-01  1353.900024  1363.199951  1340.599976  1356.000000    11232238
2025-09-02  1366.500000  1384.500000  1354.500000  1354.800049    11517006
2025-09-03  1372.599976  1376.500000  1360.500000  1369.699951     7847563
2025-09-04  1359.300049  1374.000000  1357.099976  1371.800049    13220310

In [ ]:
print(df[('Close', 'RELIANCE.NS')].iloc[-2])
print(df[('Close', 'RELIANCE.NS')].iloc[-15])

1372.5999755859375
1373.800048828125

In [ ]:
try:
    df[('Close', 'RELIANCE.NS')].iloc[-30]
except:
    print("error in getting the data")

error in getting the data

In [ ]:

reliance.info.get("debtToEquity")

36.605

In [ ]:
data = yf.download("ITC", period="1y")

C:\Users\Dhinesh\AppData\Local\Temp\ipykernel_18848\2471351659.py:1: FutureWarning: YF.download() has changed argument auto_adjust default to True
  data = yf.download("ITC", period="1y")
[*********************100%***********************]  1 of 1 completed

1 Failed download:
['ITC']: YFPricesMissingError('possibly delisted; no price data found  (period=1y)')

In [ ]:
df = yf.download("RELIANCE.NS", period="1y")

C:\Users\Dhinesh\AppData\Local\Temp\ipykernel_18848\1323053827.py:1: FutureWarning: YF.download() has changed argument auto_adjust default to True
  df = yf.download("RELIANCE.NS", period="1y")
[*********************100%***********************]  1 of 1 completed

In [ ]:
df["High"].max().iloc[0]

AttributeError: 'numpy.float64' object has no attribute 'getItem'

In [ ]:
df["High"].min().iloc[0]

np.float64(1166.590714623955)